Repository: Mih333/django-check-seo
Catalog: django-check-seo/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Meta description is too short
fr: La balise meta description est trop courte

source: between {rule_low} and {rule_high} chars
fr: entre {rule_low} et {rule_high} caractères

source: The meta description tag can be displayed in search results if it has the right length, and can influence users. Knowing that Google classifies sites according to user behaviour, it is important to have a relevant description.
fr: La balise meta description peut être affichée dans les résultats de recherche si elle a la bonne longueur, et peut influencer les utilisateurs. Sachant que Google classe les sites en fonction du comportement des utilisateurs, il est important d'avoir une description pertinente.

source: Meta description is too long
fr: La balise meta description est trop longue

source: Meta description length is correct
fr: La longueur de la meta description est bonne

source: No keyword in meta description
fr: Pas de mot-clef dans la balise meta de description

# masculin
source: at least one
fr: au moins un

source: Keywords were found in description
fr: Des mots-clef ont été trouvés dans la description

source: Too much meta description tags
fr: Trop de tags meta description

# feminin
source: only one
fr: une seule

source: Although some people write one meta description by targeted keyword, this is still an uncommon practice that is not yet recognized by all search engines.
fr: Bien que certaines personnes remplissent une balise meta description par mot-clé ciblé, il s'agit d'une pratique encore peu courante qui n'est pas encore reconnue par tous les moteurs de recherche.

source: Only one meta description tag
fr: Une seule balise meta description

# feminin
source: one
fr: une

source: No meta description
fr: Pas de balise meta description

# feminin
source: needed
fr: requise

# description
source: none
fr: aucune

source: Meta description is present
fr: La balise meta description est présente

source: %(words)d char
fr: %(words)d caractère

source: Too much h1 tags
fr: Trop de balises h1

source: exactly 1
fr: exactement 1

source: Google is not really concerned about the number of h1 tags on your page, but Bing clearly indicates in its guidelines for webmasters to use only one h1 tag per page.
fr: Google n'est pas vraiment préoccupé par le nombre de balises h1 sur votre page, mais Bing indique clairement dans ses directives pour les webmasters d'utiliser une seule balise h1 par page.

source: H1 tag found
fr: Balise H1 trouvée

source: No h1 tag
fr: Pas de balise h1

source: No keyword in h1
fr: Pas de mot clef dans la balise h1

source: at least one
fr: au moins un

source: The H1 tag represent the main title of your page, and you may populate it with appropriate content in order to ensure that users (and search engines!) will understand correctly your page.
fr: La balise h1 représente le titre principal de votre page, et vous pouvez la remplir avec le contenu approprié afin de vous assurer que les utilisateurs (et les moteurs de recherche !) comprendront correctement votre page.

source: Keyword found in H1
fr: Des mots-clés ont été trouvés dans la balise h1

# masculin
source: none
fr: aucun

source: none
fr: aucun

source: No h2 tag
fr: Pas de balise h2

source: H2 tags are useful because they are explored by search engines and can help them understand the subject of your page.
fr: Les balises h2 sont utiles car elles sont lues par les moteurs de recherche et peuvent les aider à comprendre le sujet de votre page.

source: H2 tags were found
fr: Des balises h2 ont été trouvées

source: No keyword in h2
fr: Pas de mot-clef dans la balise h2

source: Google uses h2 tags to better understand the subjects of your page.
fr: Google utilise des balises h2 pour mieux comprendre les sujets abordés sur votre page.

source: Keyword found in h2
fr: Des mots-clefs on été trouvés dans la balise h2

source: Img lack alt tag
fr: Il manque la balise alt sur une image

source: all images
fr: toutes les images

source: Your images should always have an alt tag, because it improves accessibility for visually impaired people. The name of the file is important too, because it helps Google understand what your image is about. For example, you could rename a file named "IMG0001.jpg" to "tree_with_a_bird.jpg".
fr: Vos images devraient toujours avoir une balise alt, car elle améliore l'accessibilité de votre site pour les personnes malvoyantes. Le nom du fichier est également important, car il aide Google à comprendre de quoi parle votre image. Par exemple, vous pouvez renommer un fichier nommé "IMG0001.jpg" en "arbre_avec_un_oiseau.jpg".

source: Img have alt tag
fr: Chaque image a un tag alt

source: No keyword in URL
fr: Pas de mot-clef dans l'URL

source: Keywords in URL will help your users understand the organisation of your website, and are a small ranking factor for Google. On the other hand, Bing guidelines advises to "<i>keep [your URL] clean and keyword rich when possible</i>".
fr: Les mots-clés dans l'URL aideront vos utilisateurs à comprendre l'organisation de votre site Web, et sont un petit facteur de classement pour Google. D'autre part, les directives de Bing conseillent de "<i>garder [votre URL] propre et riche en mots-clés si possible</i>".

source: Keywords found in URL
fr: Des mots-clef ont été trouvés dans l'URL

source: No keywords in meta keywords field
fr: Pas de mot-clef dans la balise meta keywords

source: Django-check-seo uses the keywords in the meta keywords field to check all other tests related to the keywords. A series of problems and warnings are related to keywords, and will therefore systematically be activated if the keywords are not filled in.
fr: Django-check-seo utilise les mots-clés présents dans le champ meta keywords pour vérifier tous les autres tests liés aux mots-clés. Un certain nombre de problèmes et d'avertissements sont liés aux mots-clef, et vont donc systématiquement être activés si les mots clefs ne sont pas renseignés.

source: Keywords found in meta keywords field
fr: Des mots-clef ont été trouvés dans la balise meta keywords

source: Not enough internal links
fr: Pas assez de liens internes

source: at least {}
fr: au moins {}

source: Internal links are useful because they can give the structure of your website to search engines, so they can create a hierarchy of your pages.
fr: Les liens internes sont utiles car ils peuvent renseigner la structure de votre site Web aux moteurs de recherche, ils peuvent ainsi créer une hiérarchie de vos pages.

source: Internal links were found
fr: Des liens internes ont été trouvés

source: Not enough external links
fr: Pas assez de liens externes

source: External links help your users to check your topic and can save them from having to do additional research.
fr: Les liens externes aident vos utilisateurs à vérifier votre sujet et peuvent leur éviter de devoir faire des recherches supplémentaires.

source: External links were found
fr: Des liens externes ont été trouvés

source: No title tag
fr: Pas de balise meta title

# masculin
source: one
fr: un

source: Titles tags are ones of the most important things to add to your pages, sinces they are the main text displayed on result search pages.
fr: La balise meta title est une des balises les plus importantes à ajouter dans vos pages, puisque ce sera son contenu qui sera affiché dans les résultats des moteurs de recherches.

source: Found title tag
fr: La balise meta title a été trouvée

source: Title tag is too short
fr: Le contenu de la balise meta title est trop court

source: more than {}
fr: plus de {}

source: Titles tags need to describe the content of the page, and need to contain at least a few words.
fr: Les balises de titres doivent décrire le contenu de la page, et doivent contenir au moins quelques mots.

source: Title tag have a good length
fr: Le contenu de la balise meta title est assez long

source: Titles tags need to describe the content of the page.
fr: Le contenu de la balise meta title doit décrire le contenu de la page.

source: Title tag is too long
fr: Le contenu de la balise meta title est trop long

source: less than {}
fr: moins de {}

source: Only the first ~55-60 chars are displayed on modern search engines results. Writing a longer title is not really required and can lead to make the user miss informations.
fr: Seuls les 55 à 60 premiers caractères sont affichés sur les résultats des moteurs de recherche modernes. Écrire un titre plus long n'est pas vraiment requis, et peut mener l'utilisateur à ne pas avoir accès à des informations qui seraient tronquées.

source: Title do not contain any keyword
fr: Le contenu de la balise meta title ne contient aucun mot-clé

source: Titles tags need to contain at least one keyword, since they are one of the most important content of the page for search engines.
fr: Le contenu des balises meta title doivent contenir au moins un mot-clé, puisqu'elles constituent l'un des contenus les plus importants de la page pour les moteurs de recherche.

source: Keywords found in title
fr: Des mots-clef ont été trouvés dans le contenu de la balise meta title

source: Too many levels in path
fr: Trop de niveaux dans le chemin de l'URL la page

source: Google recommand to organize your content by adding depth in your url, but advises against putting too much depth.
fr: Google recommande d'organiser votre contenu en ajoutant de la profondeur dans votre URL, mais déconseille de trop en mettre.

source: URL is too long
fr: L'URL est trop longue

source: Shorter URLs tend to rank better than long URLs.
fr: Les URL plus courtes ont tendance à être mieux classées que les URL longues.

source: Right amount of level in path
fr: Profondeur de l'URL correcte

source: URL length is great
fr: Longueur de l'URL correcte

source: Content is too short
fr: Le contenu est trop court

source: at least {min} words, more than {min2} if possible
fr: au moins {min} mots, plus de {min2} si possible

source: Longer articles tend to be better ranked, but will require better writing skills than shorter articles.
fr: Les articles plus longs ont tendance à être mieux classés, mais exigeront de meilleures compétences en rédaction que les articles plus courts.

source: Content length is right
fr: La longueur du contenu est correcte

source: No keyword in first paragraph
fr: Aucun mot-clé dans le premier paragraphe

source: before {settings} words
fr: avant {settings} mots

source: The reader will be relieved to find one of his keywords in the first paragraph of your page, and the same logic applies to Google, which will consider the content more relevant.
fr: Le lecteur sera soulagé de trouver un de ses mots-clés dans le premier paragraphe de votre page, et la même logique s'applique à Google, qui jugera le contenu plus pertinent.

source: Keywords found in first paragraph
fr: Des mots-clefs on été trouvés dans le premier paragraphe

source: settings
fr: paramètres

source: found
fr: trouvé

source: About
fr: À propos

source: The main objective of this application is to provide basic knowledge to users who do not necessarily have a good understanding of SEO.
fr: L'objectif principal de cette application est de fournir des connaissances de base aux utilisateurs qui n'ont pas nécessairement une bonne compréhension du référencement.

source: The documentation is available via the <a href=\"https://github.com/kapt-labs/django-check-seo/wiki\" target=\"_blank\">project wiki</a>.
fr: La documentation est disponible via le <a href=\"https://github.com/kapt-labs/django-check-seo/wiki\" target=\"_blank\">wiki du projet</a>.

source: Raw data are here for debug purposes. Join at least your settings if you're submitting <a href=\"https://github.com/kapt-labs/django-check-seo/issues\">a new issue</a>.
fr: Les données brutes sont affichées à des fins de débogage. Joignez au moins les paramètres si vous soumettez <a href=\"https://github.com/kapt-labs/django-check-seo/issues\">un nouveau ticket</a>.

source: See extracted html
fr: Voir html extrait

source: See extracted content
fr: Voir contenu extrait

source: See settings
fr: Voir les paramètres

source: <strong class="green-bg">No problem</strong> was found on the page!
fr: <strong class="green-bg">Aucun problème</strong> n'a été trouvé sur la page !

source: <strong class="green-bg">No problem</strong> found, and
fr: <strong class="green-bg">Aucun problème</strong> trouvé, et

source: {nb_problems} problem</strong> found, and
fr: {nb_problems} problème</strong> trouvé, et

source: <strong class="green-bg">no warning</strong> raised
fr: <strong class="green-bg">pas d'avertissement</strong> levé

source: {nb_warnings} warning</strong> raised
fr: {nb_warnings} avertissement</strong> levé
